In [ ]:
# http://www.sql-join.com/

In [7]:
import pandas as pd

In [15]:
# exmplain customer table
df_customers = pd.read_csv('./data/customers.csv')
df_customers

   customer_id first_name   last_name
0            1     George  Washington
1            2       John       Adams
2            3     Thomas   Jefferson
3            4      James     Madison
4            5      James      Monroe

In [26]:
# explain orders table
df_orders = pd.read_csv('./data/orders.csv')
df_orders

   Unnamed: 0  order_id  order_date  amount  customer_id
0           0         1  07/04/1776  234.56            1
1           1         2  03/14/1760   78.50            3
2           2         3  05/23/1784  124.00            2
3           3         4  09/03/1790   65.50            3
4           4         5  07/21/1795   25.50           10
5           5         6  11/27/1787   14.40            9

In [27]:
# merge two tables base on same column 'customer_id'
df_merged = pd.merge(left=df_customers,
                     right=df_orders, 
                     on='customer_id',
                     how='inner')
df_merged

,customer_id,first_name,last_name,Unnamed: 0,order_id,order_date,amount
0,1,George,Washington,0,1,07/04/1776,234.56
1,2,John,Adams,2,3,05/23/1784,124.00
2,3,Thomas,Jefferson,1,2,03/14/1760,78.50
3,3,Thomas,Jefferson,3,4,09/03/1790,65.50

In [29]:
# so which customer have largest amount spent ?
# use groupby then sum on 'amount' column
df_merged.groupby('customer_id').sum()['amount']

customer_id
1    234.56
2    124.00
3    144.00
Name: amount, dtype: float64